Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/asylum_seekers_and_refugees/refugee_status_and_leave_to_remain/rights_of_convention_programme_refugees_people_given_leave_to_remain.html.txt.tmx
Source language: en
Languages: ga

source: Rights conferred on people granted refugee or subsidiary protection status or permission to remain
ga: Cearta a bhronntar ar dhaoine stádas dídeanaí nó cosaint choimhdeach agus daoine a dtugtar cead fanacht dóibh

source: If the Minister for Justice and Equality gives you a refugee or subsidiary protection declaration or permission to remain in Ireland, you are entitled to certain rights
ga: Nuair tugann an tAire Dlí agus Cirt agus Comhionannas dearbhú dídeanaí nó cosaint choimhdeach nó cead fanacht in Éirinn duit, tá tú i dteideal cearta áirithe

source: The rights for people with refugee status or subsidiary protection are different from those for people granted permission to remain in the State – see below
ga: Ní hionann na cearta daoine le stádas dídeanaí agus daoine le cosaint choimhdeach agus daoine le cead fanacht sa Stát – féach thíos

source: If you have previously been granted refugee status under the Refugee Act 1996, as amended or subsidiary protection under the European Union (Subsidiary Protection) Regulations 2013, your rights are now set out in the International Protection Act 2015, as described below
ga: D’fhoilsigh an Roinn Dlí agus Cirt agus Comhionannas treoir um maireachtáil neamhspleách (pdf) do dhaoine a bhronntar stádas dídeanaí nó cosaint choimhdeach nó cead fanacht dóibh

source: Under Section 53 of the International Protection Act 2015, people granted international protection (refugee status or subsidiary protection) have:
ga: Faoi alt 3 d’Acht na nDídeanaithe 1996, arna leasaithe. tá na cearta seo ag dídeanaithe Choinbhinsiúin:

source: • The right to seek and enter employment in the State
ga: • An ceart chun fostaíocht a lorg agus a iontráil sa stát;

source: • The right to carry on any business, trade or profession in the State
ga: • An ceart chun aon ghnó, trádáil nó gairm a chleachtadh sa Stát;

source: • The right to access education and training in the like manner and to the like extent in all respects as an Irish citizen
ga: • An ceart chun rochtain ar oideachas agus oiliúint ar an mbealach céanna agus ar a mhéad céanna i ngach gné le saoránach Éireannach;

source: • The right to receive the same medical care and services and the same social welfare benefits, including housing, as an Irish citizen
ga: • An ceart chun an cúram agus na seirbhísí leighis chéanna agus na sochair leasa shóisialaigh chéanna, lena n-áirítear tithíocht, le saoránach Éireannach;

source: • The right to reside in the State for at least 3 years
ga: • An ceart chun cónaí sa Stát;

source: This is renewable unless there are compelling reasons of national security or public order (ordre public) not to do so
ga: • An ceart céanna chun cumainn agus ceardchumainn a bhunú agus a bheith ina mball díobh le saoránach Éireannach;

source: • The same rights of travel in, or to or from the State as those to which Irish citizens are entitled (note: this is on the basis that the Minister for Justice and Equality issues a travel document)
ga: • An ceart chun cur isteach chuig an Aire Dlí agus Cirt agus Comhionannais ar chead do bhall dá dteaghlaigh nó páirtnéir sibhialta chun iontráil agus cónaí sa Stát. Dídeanaithe chláir

source: • The right to apply to the Minister for Justice and Equality for permission for a member of their family to enter and reside in the State
ga: Beidh an teidlíocht chéanna ag dídeanaí cláir, don tréimhse a mbíonn teidlíocht acu chun fanacht sa stát, ar na cearta agus na pribhléidí a thugtar do dídeanaithe Choinbhinsiúin

source: Programme refugees will, for the period they are entitled to remain in the State, have the same entitlement to the rights and privileges given to Convention refugees
ga: • An ceart chun fostaíocht a lorg agus a iontráil sa Stát; • An ceart chun aon ghnó, trádáil nó gairm a chleachtadh sa Stát;

source: You can read more about these different terms for refugees in our document, Coming to Ireland as an asylum seeker or refugee
ga: • An ceart chun rochtain ar oideachas agus oiliúint ar an mbealach céanna agus ar a mhéad céanna i ngach gné le saoránach Éireannach;

source: While it is not set out in legislation, people given permission to remain in the State are normally conferred with many of the same rights and privileges as those conferred on Convention refugees
ga: Cé nach leagtar amach sa reachtaíocht é, is iondúil go mbronntar an cuid is mó de na cearta agus na pribhléidí céanna ar dhaoine a dtugtar cead fanacht dóibh agus dídeanaithe Choinbhinsiúin, faoi alt 3 d’Acht na nDídeanaithe 1996, arna leasaithe

source: They do not have the right to family reunification but anyone who is entitled to reside and remain in the State may apply to the Minister for Justice and Equality to permit family members or to join them
ga: Níl an ceart acu chun athaontú teaghlaigh ach féadann aon duine a bhíonn i dteideal cónaí agus fanacht sa Stát cur isteach chuig an Aire chun ceadú do bhaill teaghlaigh a bheith leo

source: The Minister can grant or refuse permission on a discretionary basis
ga: Féadann an tAire Dlí agus Cirt agus Comhionannais cead a bhronnadh nó a dhiúltú ar bhonn discréideach
